export interface IReview {
  id: string;
  movieTitle: string;
  comment: string;
  writer: string;
  profileUrl: string;
  rating: number;
  likes: number;
  dislikes: number;
}

export const dummyReviews: Array<IReview> = [
  {
    id: '1',
    movieTitle: '엘리멘탈',
    comment: '1마음이 따뜻해지고 영상이 너무 아름다워요.',
    writer: '소문난칠공주',
    profileUrl: './assets/profile.jpg',
    rating: 10,
    likes: 10,
    dislikes: 0,
  },
  {
    id: '2',
    movieTitle: '엘리멘탈',
    comment:
      '2마음이 따뜻해지고 영상이 너무 아름다워요. 마음이 따뜻해지고 영상이 너무 아름다워요. 마음이 따뜻해지고 영상이 너무 아름다워요. 마음이 따뜻해지고 영상이 너무 아름다워요. 마음이 따뜻해지고 영상이 너무 아름다워요. 마음이 따뜻해지고 영상이 너무 아름다워요.',
    writer: '맛있는짜장면',
    profileUrl: '../assets/profile.jpg',
    rating: 9,
    likes: 0,
    dislikes: 2,
  },
  {
    id: '3',
    movieTitle: '엘리멘탈',
    comment:
      '3마음이 따뜻해지고 영상이 너무 아름다워요. 마음이 따뜻해지고 영상이 너무 아름다워요. 마음이 따뜻해지고 영상이 너무 아름다워요. 마음이 따뜻해지고 영상이 너무 아름다워요. 마음이 따뜻해지고 영상이 너무 아름다워요. 마음이 따뜻해지고 영상이 너무 아름다워요.',
    writer: '맛있는짜장면',
    profileUrl: '../assets/profile.jpg',
    rating: 9,
    likes: 0,
    dislikes: 2,
  },
  {
    id: '4',
    movieTitle: '엘리멘탈',
    comment:
      '4엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요',
    writer: '맛있는짜장면',
    profileUrl: '../assets/profile.jpg',
    rating: 9,
    likes: 0,
    dislikes: 2,
  },
  {
    id: '5',
    movieTitle: '엘리멘탈',
    comment:
      '5마음이 따뜻해지고 영상이 너무 아름다워요. 마음이 따뜻해지고 영상이 너무 아름다워요. 마음이 따뜻해지고 영상이 너무 아름다워요. 마음이 따뜻해지고 영상이 너무 아름다워요. 마음이 따뜻해지고 영상이 너무 아름다워요. 마음이 따뜻해지고 영상이 너무 아름다워요.',
    writer: '맛있는짜장면',
    profileUrl: '../assets/profile.jpg',
    rating: 9,
    likes: 0,
    dislikes: 2,
  },
  {
    id: '6',
    movieTitle: '엘리멘탈',
    comment:
      '6엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요',
    writer: '맛있는짜장면',
    profileUrl: '../assets/profile.jpg',
    rating: 9,
    likes: 0,
    dislikes: 2,
  },
  {
    id: '7',
    movieTitle: '엘리멘탈',
    comment:
      '7엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요',
    writer: '맛있는짜장면',
    profileUrl: '../assets/profile.jpg',
    rating: 9,
    likes: 0,
    dislikes: 2,
  },
  {
    id: '8',
    movieTitle: '엘리멘탈',
    comment:
      '8엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요',
    writer: '맛있는짜장면',
    profileUrl: '../assets/profile.jpg',
    rating: 9,
    likes: 0,
    dislikes: 2,
  },
  {
    id: '9',
    movieTitle: '엘리멘탈',
    comment:
      '9엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요',
    writer: '맛있는짜장면',
    profileUrl: '../assets/profile.jpg',
    rating: 9,
    likes: 0,
    dislikes: 2,
  },
  {
    id: '10',
    movieTitle: '엘리멘탈',
    comment:
      '10엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요',
    writer: '맛있는짜장면',
    profileUrl: '../assets/profile.jpg',
    rating: 9,
    likes: 0,
    dislikes: 2,
  },
  {
    id: '11',
    movieTitle: '엘리멘탈',
    comment:
      '11엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요',
    writer: '맛있는짜장면',
    profileUrl: '../assets/profile.jpg',
    rating: 9,
    likes: 0,
    dislikes: 2,
  },
  {
    id: '12',
    movieTitle: '엘리멘탈',
    comment:
      '12엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요',
    writer: '맛있는짜장면',
    profileUrl: '../assets/profile.jpg',
    rating: 9,
    likes: 0,
    dislikes: 2,
  },
  {
    id: '13',
    movieTitle: '엘리멘탈',
    comment:
      '13엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요',
    writer: '맛있는짜장면',
    profileUrl: '../assets/profile.jpg',
    rating: 9,
    likes: 0,
    dislikes: 2,
  },
  {
    id: '14',
    movieTitle: '엘리멘탈',
    comment:
      '14엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요',
    writer: '맛있는짜장면',
    profileUrl: '../assets/profile.jpg',
    rating: 9,
    likes: 0,
    dislikes: 2,
  },

  {
    id: '15',
    movieTitle: '엘리멘탈',
    comment:
      '15엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요',
    writer: '맛있는짜장면',
    profileUrl: '../assets/profile.jpg',
    rating: 9,
    likes: 0,
    dislikes: 2,
  },
  {
    id: '16',
    movieTitle: '엘리멘탈',
    comment:
      '16엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요',
    writer: '맛있는짜장면',
    profileUrl: '../assets/profile.jpg',
    rating: 9,
    likes: 0,
    dislikes: 2,
  },
  {
    id: '17',
    movieTitle: '엘리멘탈',
    comment:
      '17엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요엘리멘탈재밌어요',
    writer: '맛있는짜장면',
    profileUrl: '../assets/profile.jpg',
    rating: 9,
    likes: 0,
    dislikes: 2,
  },
];
